# 1.

In [2]:
from pandas import DataFrame
df = DataFrame(
                [
                   ['Aryan','Singh','Full-Time','Administration',2,20000],
                   ['Rohan','Agarwal','Intern','Technical',3,5000],
                   ['Riya','Shah','Full-Time','Administration',5,10000],
                   ['Yash','Bhatia','Part-Time','Technical',7,100000],
                   ['Siddhant','Khanna','Full-Time','Management',6,200000]
                ]
                ,columns=['First Name','Last Name','Type','Department','YoE','Salary']

              )
                
df

  First Name Last Name       Type      Department  YoE  Salary
0      Aryan     Singh  Full-Time  Administration    2   20000
1      Rohan   Agarwal     Intern       Technical    3    5000
2       Riya      Shah  Full-Time  Administration    5   10000
3       Yash    Bhatia  Part-Time       Technical    7  100000
4   Siddhant    Khanna  Full-Time      Management    6  200000

 Make a pivot table which shows average salary of each type of employee for each
department.

In [7]:
import pandas as pd
table = pd.pivot_table(df,index="Type",columns="Department",values="Salary",aggfunc="mean")
table

Department  Administration  Management  Technical
Type
Full-Time          15000.0    200000.0        NaN
Intern                 NaN         NaN     5000.0
Part-Time              NaN         NaN   100000.0

Make a pivot table which shows the sum and mean of the salaries of each type of
employee and the number of employees of each type

In [16]:
table1 = pd.pivot_table(df,index="Type",values='Salary',aggfunc=['sum','mean','count'],)
table1

              sum           mean  count
           Salary         Salary Salary
Type
Full-Time  230000   76666.666667      3
Intern       5000    5000.000000      1
Part-Time  100000  100000.000000      1